solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9896/fsl_hal_registers.c
status_t executeParam(tfa9896_handle_t *handle)
{
    status_t error;
    unsigned short cf_ctrl = 0x0002; /* the value to be sent to the CF_CONTROLS register: cf_req=00000000, cf_int=0,
                                        cf_aif=0, cf_dmem=XMEM=01, cf_rst_dsp=0 */
    cf_ctrl |= (1 << 8) | (1 << 4);  /* set the cf_req1 and cf_int bit */
    error = TFA9896_WriteRegister(handle, 0x70, (uint16_t)cf_ctrl);
    return error;
}

status_t waitResult(tfa9896_handle_t *handle)
{
    status_t error;
    unsigned short cf_status; /* the contents of the CF_STATUS register */
    int tries = 0;
    do
    {
        error = TFA9896_ReadRegister(handle, 0x73, &cf_status);
        tries++;
    } while ((error == kStatus_TFA9896_Ok) && ((cf_status & 0x0100) == 0) &&
             (tries < TFA9896_API_WAITRESULT_NTRIES)); /* don't wait forever, DSP is pretty quick to respond (< 1ms) */
    if (tries >= TFA9896_API_WAITRESULT_NTRIES)
    {
        /* something wrong with communication with DSP */
        error = kStatus_TFA9896_DSP_not_running;
    }
    return error;
}

status_t TFA9896_DspSetParam(tfa9896_handle_t *handle,
                             unsigned char module_id,
                             unsigned char param_id,
                             int num_bytes,
                             const unsigned char data[])
{
    status_t error;
    int rpcStatus = STATUS_OK;
    /* 1) write the id and data to the DSP XMEM */
    error = writeParameter(handle, module_id, param_id, num_bytes, data);
    /* 2) wake up the DSP and let it process the data */
    if (error == kStatus_TFA9896_Ok)
    {
        error = executeParam(handle);
    }
    /* check the result when addressed an IC uniquely */
    if (handle->config->slaveAddress != 0x1C)
    {
        /* 3) wait for the ack */
        if (error == kStatus_TFA9896_Ok)
        {
            error = waitResult(handle);
        }
        /* 4) check the RPC return value */
        if (error == kStatus_TFA9896_Ok)
        {
            error = checkRpcStatus(handle, &rpcStatus);
            TFA9896_Printf("rpcStatus:%d\n", rpcStatus);
        }
        if (error == kStatus_TFA9896_Ok)
        {
            if (rpcStatus != STATUS_OK)
            {
                /* DSP RPC call returned an error */
                error = (status_t)(rpcStatus + kStatus_TFA9896_RpcBase);
            }
        }
    }
    return error;
}

void tfa9896_convert_data2bytes(int num_data, const int data[], unsigned char bytes[])
{
    int i; /* index for data */
    int k; /* index for bytes */
    int d;
    /* note: cannot just take the lowest 3 bytes from the 32 bit
     * integer, because also need to take care of clipping any
     * value > 2&23 */
    for (i = 0, k = 0; i < num_data; ++i, k += 3)
    {
        if (data[i] >= 0)
        {
            d = MIN(data[i], (1 << 23) - 1);
        }
        else
        {
            /* 2's complement */
            d = (1 << 24) - MIN(-data[i], 1 << 23);
        }
        bytes[k]     = (d >> 16) & 0xFF; /* MSB */
        bytes[k + 1] = (d >> 8) & 0xFF;
        bytes[k + 2] = (d)&0xFF;         /* LSB */
    }
}

void tfa9896_convert_bytes2data(int num_bytes, const unsigned char bytes[], int data[])
{
    int i; /* index for data */
    int k; /* index for bytes */
    int d;
    int num_data = num_bytes / 3;

    for (i = 0, k = 0; i < num_data; ++i, k += 3)
    {
        d = (bytes[k] << 16) | (bytes[k + 1] << 8) | (bytes[k + 2]);
        if (bytes[k] & 0x80) /* sign bit was set */
        {
            d = -((1 << 24) - d);
        }

        data[i] = d;
    }
}

status_t TFA9896_DspBiquad_Disable(tfa9896_handle_t *handle, int biquad_index)
{
    int coeff_buffer[6];
    unsigned char bytes[6 * 3];
    status_t error = kStatus_TFA9896_Ok;
    /* set in correct order and format for the DSP */
    coeff_buffer[0] = (int)-8388608; /* -1.0f */
    coeff_buffer[1] = 0;
    coeff_buffer[2] = 0;
    coeff_buffer[3] = 0;
    coeff_buffer[4] = 0;
    coeff_buffer[5] = 0;
    /* convert float to fixed point and then bytes suitable for transmaission over I2C */
    tfa9896_convert_data2bytes(6, coeff_buffer, bytes);
    error = TFA9896_DspSetParam(handle, 2, (unsigned char)biquad_index, (unsigned char)6 * 3, bytes);

    return error;
}

#ifdef TFA9896_DEBUG_DATA
void printArray(char *ptr, size_t size)
{
    char *const end = ptr + size;
    while (ptr < end)
    {
        TFA9896_Printf("[%x]-", *ptr++);
    }
}
#endif

status_t TFA9896_Write_FilterBank(tfa9896_handle_t *handle, tfa9896FilterM_t *filter)
{
    unsigned char biquad_index;
    status_t error = kStatus_TFA9896_Ok;
    for (biquad_index = 0; biquad_index < 10; biquad_index++)
    {
        if (filter[biquad_index].enabled)
        {
            TFA9896_Printf("TFA9896_Write_FilterBank inside if block\n");
            error = TFA9896_DspSetParam(handle, 2, biquad_index + 1, sizeof(filter[biquad_index].biquad.bytes),
                                        filter[biquad_index].biquad.bytes);
        }
        else
        {
            TFA9896_Printf("TFA9896_Write_FilterBank inside else block\n");
            error = TFA9896_DspBiquad_Disable(handle, biquad_index + 1);
        }
    }
    return error;
}

unsigned char vsfwdelay_table[] = {
    0, 0, 2, /*Index 0 - Current/Volt Fractional Delay for 8KHz  */
    0, 0, 0, /*Index 1 - Current/Volt Fractional Delay for 11KHz */
    0, 0, 0, /*Index 2 - Current/Volt Fractional Delay for 12KHz */
    0, 0, 2, /*Index 3 - Current/Volt Fractional Delay for 16KHz */
    0, 0, 2, /*Index 4 - Current/Volt Fractional Delay for 22KHz */
    0, 0, 2, /*Index 5 - Current/Volt Fractional Delay for 24KHz */
    0, 0, 2, /*Index 6 - Current/Volt Fractional Delay for 32KHz */
    0, 0, 2, /*Index 7 - Current/Volt Fractional Delay for 44KHz */
    0, 0, 3  /*Index 8 - Current/Volt Fractional Delay for 48KHz */
};
unsigned char cvfracdelay_table[] = {
    0, 0, 51, /*Index 0 - Current/Volt Fractional Delay for 8KHz  */
    0, 0, 0,  /*Index 1 - Current/Volt Fractional Delay for 11KHz */
    0, 0, 0,  /*Index 2 - Current/Volt Fractional Delay for 12KHz */
    0, 0, 38, /*Index 3 - Current/Volt Fractional Delay for 16KHz */
    0, 0, 34, /*Index 4 - Current/Volt Fractional Delay for 22KHz */
    0, 0, 33, /*Index 5 - Current/Volt Fractional Delay for 24KHz */
    0, 0, 11, /*Index 6 - Current/Volt Fractional Delay for 32KHz */
    0, 0, 2,  /*Index 7 - Current/Volt Fractional Delay for 44KHz */
    0, 0, 62  /*Index 8 - Current/Volt Fractional Delay for 48KHz */
};

status_t tfa_dsp_write_cvfracdelay_table(tfa9896_handle_t *handle)
{
    TFA9896_Printf("Bytes  cvfracdelay_table_96 to be written:%d\n", sizeof(cvfracdelay_table));
    return TFA9896_DspSetParam(handle, MODULE_FRAMEWORK, 0x06, sizeof(cvfracdelay_table), cvfracdelay_table);
}

status_t tfa_dsp_write_vsfwdelay_table(tfa9896_handle_t *handle)
{
    TFA9896_Printf("Bytes  vsfwdelay_table_96 to be written:%d\n", sizeof(vsfwdelay_table));
    return TFA9896_DspSetParam(handle, MODULE_FRAMEWORK, 0x03, sizeof(vsfwdelay_table), vsfwdelay_table);
}

