solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9896/fsl_hal_registers.c
status_t TFA9896_DSPWriteTables(tfa9896_handle_t *handle)
{
    status_t error = kStatus_TFA9896_Ok;

    error = tfa_dsp_write_vsfwdelay_table(handle);
    if (error == kStatus_TFA9896_Ok)
    {
        error = tfa_dsp_write_cvfracdelay_table(handle);
        assert(error == kStatus_TFA9896_Ok);
    }

    TFA9896_SetBits(handle, TFA1_BF_RST, 1);
    assert(error == kStatus_TFA9896_Ok);
    TFA9896_SetBits(handle, TFA1_BF_RST, 0);
    assert(error == kStatus_TFA9896_Ok);
    return error;
}

status_t TFA9896_ProcessPatchFile(tfa9896_handle_t *handle, int length, const unsigned char *bytes)
{
    unsigned short size;
    int index;

    status_t err = kStatus_TFA9896_Ok;
#if defined(DEMO_VERBOSE)
    int i;
#endif

    /* expect following format in patchBytes:
     * 2 bytes length of I2C transaction in little endian, then the bytes, excluding the slave address which is added
     * from the handle This repeats for the whole file
     */
    index = 0;

    while (index < length)
    {
        /* extract little endian length */
        size = bytes[index] + bytes[index + 1] * 256;
        index += 2;
        if ((index + size) > length)
        {
            /* too big, outside the buffer, error in the input data */
            return kStatus_TFA9896_Bad_Parameter;
        }
        if ((size + 1) > MAX_I2C_LENGTH)
        {
            /* too big, must fit buffer */
            return kStatus_TFA9896_Bad_Parameter;
        }

#ifdef TFA9896_PRINT_DEBUG
        /* TFA9896_Printf("Bytes to be written_patch:%d (index = %d bytes[index] = %d bytes[index+1] = %d\r\n",size,
         index, bytes[index], bytes[index+1]);*/
#endif

        err = CODEC_I2C_Send(handle->i2cHandle, handle->config->slaveAddress, 0U, 0U, (void *)(bytes + index), size);

        if (err != kStatus_Success)
        {
#ifdef TFA9896_PRINT_DEBUG
            TFA9896_Printf("I2C write error at %d\r\n", size);
#endif
            err = kStatus_TFA9896_I2C_Fatal;
            break;
        }
#if defined(DEMO_VERBOSE)
        for (i = 0; i < transfer.dataSize; i++)
            TFA9896_Printf("[%02x]-", (unsigned char)((unsigned char *)transfer.data + i));
        TFA9896_Printf("\r\n");
#endif
        index += size;
    }

    return err;
}

status_t TFA9896_DspWritePreset(tfa9896_handle_t *handle, int length, const unsigned char *pPresetBytes)
{
    status_t error = kStatus_TFA9896_Ok;
    if (pPresetBytes != 0)
    {
        TFA9896_Printf("Bytes to be written_preset_end:%d\n", length);
        /* by design: keep the data opaque and no interpreting/calculation */
        error = TFA9896_DspSetParam(handle, MODULE_SPEAKERBOOST, SB_PARAM_SET_PRESET, length, pPresetBytes);
        TFA9896_Printf("Bytes  written_preset_end:%d\n", length);
    }
    else
    {
        error = kStatus_TFA9896_Bad_Parameter;
    }
    return error;
}

status_t TFA9896_DspWriteConfig(tfa9896_handle_t *handle, int length, const unsigned char *pConfigBytes)
{
    status_t error = kStatus_TFA9896_Ok;
    TFA9896_Printf("Bytes to be written_config:%d\n", length);
    error = TFA9896_DspSetParam(handle, MODULE_SPEAKERBOOST, SB_PARAM_SET_CONFIG, length, pConfigBytes);
    TFA9896_Printf("Bytes to written_config_end:%d\n", length);
    return error;
}

status_t TFA9896_DspWriteSpeakerParameters(tfa9896_handle_t *handle, int length, const unsigned char *pSpeakerBytes)
{
    status_t error;
    if (pSpeakerBytes != 0)
    {
        TFA9896_Printf("Bytes to be written_speaker:%d\n", length);
        /* by design: keep the data opaque and no interpreting/calculation */
        error = TFA9896_DspSetParam(handle, MODULE_SPEAKERBOOST, SB_PARAM_SET_LSMODEL, length, pSpeakerBytes);

        TFA9896_Printf("Bytes to written_speaker_end:%d\n", length);
    }
    else
    {
        error = kStatus_TFA9896_Bad_Parameter;
    }

    return error;
}

uint16_t tfa_get_bf_value(const uint16_t bf, const uint16_t reg_value)
{
    uint16_t msk, value;

    /*
     * bitfield enum:
     * - 0..3  : len
     * - 4..7  : pos
     * - 8..15 : address
     */
    uint8_t len = bf & 0x0f;
    uint8_t pos = (bf >> 4) & 0x0f;

    msk   = ((1 << (len + 1)) - 1) << pos;
    value = (reg_value & msk) >> pos;

    return value;
}

#ifdef TFA9890_DEVICE
static uint16_t tfa9890_dsp_system_stable(tfa9896_handle_t *handle, int *ready)
{
    char error;
    unsigned short status, mtp0;
    int result;
    uint8_t tries;
    /************************/
    result = tfa_read_reg(handle, TFA1_BF_AREFS);
    if (result < 0)
    {
        error = -result;
        goto errorExit;
    }
    status = (unsigned short)result;

    /* if AMPS is set then we were already configured and running
     *   no need to check further
     */
    *ready = (tfa_get_bf_value(TFA1_BF_AMPS, status) == 1);
    if (*ready)   /* if  ready go back */
    {
        return 0; /* will be kStatus_TFA9896_Ok */
    }

    /* check AREFS and CLKS: not ready if either is clear */
    *ready = !((tfa_get_bf_value(TFA1_BF_AREFS, status) == 0) || (tfa_get_bf_value(TFA1_BF_CLKS, status) == 0));
    if (!*ready)  /* if not ready go back */
    {
        return 0; /* will be kStatus_TFA9896_Ok */
    }

    /* check MTPB
     *   mtpbusy will be active when the subsys copies MTP to I2C
     *   2 times retry avoids catching this short mtpbusy active period
     */
    for (tries = 2; tries > 0; tries--)
    {
        result = TFA9896_GetBits(handle, TFA1_BF_MTPB);
        if (result < 0)
        {
            error = -result;
            goto errorExit;
        }
        status = (unsigned short)result;

        /* check the contents of the STATUS register */
        *ready = (status == 0);
        if (*ready) /* if ready go on */
        {
            break;
        }
    }
    if (tries == 0) /* ready will be 0 if retries exausted */
    {
        return 0;
    }
    /* check the contents of  MTP register for non-zero,
     *  this indicates that the subsys is ready  */

    error = TFA9896_ReadRegister(handle, 0x84, &mtp0);
    if (error)
    {
        goto errorExit;
    }

    *ready = (mtp0 != 0); /* The MTP register written? */

    return error;

errorExit:
    *ready = 0;
    return error;
}
#endif

status_t setOtc(tfa9896_handle_t *handle, int otcOn)
{
    unsigned short mtp;
    status_t err;
    unsigned short status;
    int mtpChanged = 0;
    int i;

    TFA9896_Printf("Inside setOtc\n");
    err = TFA9896_ReadRegister(handle, 0x80, &mtp);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    TFA9896_Printf("mtp:%d--mtp & 0x01:%d--otcOn:%d\n", mtp, (mtp & 0x01), otcOn);
    /* set reset MTPEX bit if needed */
    if ((mtp & 0x01) != otcOn)
    {
        TFA9896_Printf("writing into 0x5A and setting OTC\n");
        /* need to change the OTC bit, set MTPEX=0 in any case */
        err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0x5A);
        if (err != kStatus_TFA9896_Ok)
        {
            return err;
        }
        err = TFA9896_WriteRegister(handle, 0x80, (uint16_t)otcOn);
        if (err != kStatus_TFA9896_Ok)
        {
            return err;
        }
        err = TFA9896_WriteRegister(handle, 0x62, 1 << 11);
        if (err != kStatus_TFA9896_Ok)
        {
            return err;
        }
        mtpChanged = 1;
    }
    do
    {
        for (i = 0; i < 0xfff; i++)
            ;
        err = TFA9896_ReadRegister(handle, 0x00, &status);
        if (err != kStatus_TFA9896_Ok)
        {
            return err;
        }

    } while ((status & 0x100) == 0x100);
    assert((status & 0x100) == 0);
    if (mtpChanged)
    {
        TFA9896_Printf("writing 0x01 into 0x70\n");
        err = TFA9896_WriteRegister(handle, 0x70, (uint16_t)0x1);
        if (err != kStatus_TFA9896_Ok)
        {
            return err;
        }
    }

    return kStatus_TFA9896_Ok;
}

status_t TFA9896_SetConfigured(tfa9896_handle_t *handle)
{
    status_t error;
    unsigned short value;
    /* read the SystemControl register, modify the bit and write again */
    error = TFA9896_ReadRegister(handle, 0x09, &value);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    value |= 0x20;
    error = TFA9896_WriteRegister(handle, 0x09, value);
    return error;
}

status_t TFA9896_DspReadMem(tfa9896_handle_t *handle, unsigned short start_offset, int num_words, int *pValues)
{
    status_t error = kStatus_TFA9896_Ok;
    unsigned short cf_ctrl; /* the value to sent to the CF_CONTROLS register */
    unsigned char bytes[MAX_PARAM_SIZE /*MAX_I2C_LENGTH*/];
    int burst_size;         /* number of words per burst size */
    int bytes_per_word = 3;
    int num_bytes;
    int *p;
    /* first set DMEM and AIF, leaving other bits intact */
    error = TFA9896_ReadRegister(handle, 0x70, &cf_ctrl);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    cf_ctrl &= ~0x000E;          /* clear AIF & DMEM */
    cf_ctrl |= (DMEM_XMEM << 1); /* set DMEM, leave AIF cleared for autoincrement */
    error = TFA9896_WriteRegister(handle, 0x70, cf_ctrl);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    error = TFA9896_WriteRegister(handle, 0x71, start_offset);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    num_bytes = num_words * bytes_per_word;
    p         = pValues;
    for (; num_bytes > 0;)
    {
        burst_size = ROUND_DOWN(MAX_I2C_LENGTH, bytes_per_word);
        if (num_bytes < burst_size)
        {
            burst_size = num_bytes;
        }
        assert(burst_size <= sizeof(bytes));
        error = TFA9896_ReadData(handle, 0x72, burst_size, bytes);
        if (error != kStatus_TFA9896_Ok)
        {
            return error;
        }
        tfa9896_convert_bytes2data(burst_size, bytes, p);
        num_bytes -= burst_size;
        p += burst_size / bytes_per_word;
    }
    return kStatus_TFA9896_Ok;
}

status_t TFA9896_DspExecuteRpc(tfa9896_handle_t *handle,
                               unsigned char module_id,
                               unsigned char param_id,
                               int num_inbytes,
                               unsigned char indata[],
                               int num_outbytes,
                               unsigned char outdata[])
{
    status_t error;
    int rpcStatus = STATUS_OK;
    int i;

    /* 1) write the id and data to the DSP XMEM */
    error = writeParameter(handle, module_id, param_id, num_inbytes, indata);

    /* 2) wake up the DSP and let it process the data */
    if (error == kStatus_TFA9896_Ok)
    {
        error = executeParam(handle);
    }

    /* 3) wait for the ack */
    if (error == kStatus_TFA9896_Ok)
    {
        error = waitResult(handle);
    }

    /* 4) check the RPC return value */
    if (error == kStatus_TFA9896_Ok)
    {
        error = checkRpcStatus(handle, &rpcStatus);
    }
    if (error == kStatus_TFA9896_Ok)
    {
        if (rpcStatus != STATUS_OK)
        {
            /* DSP RPC call returned an error */
            error = (status_t)(rpcStatus + kStatus_TFA9896_RpcBase);
        }
    }

