solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9896/fsl_hal_registers.c
    tfa9896_convert_bytes2data(3, bytes, data);
    mohm = ((float)data[0] * 1024) / TFA1_FW_ReZ_SCALE;

    TFA9896_Printf(" Calibrated value :%1.2f mOhms :\n", (mohm * 1024) / 1000);
#endif

    return err;
}

status_t TFA9896_SetOneTimeCalibration(tfa9896_handle_t *handle)
{
    unsigned short mtp = 0;
    status_t err       = kStatus_TFA9896_Ok;
    int tries = 0, mtpBusy = 0;
    int i;
    /* Read MTP register*/
    TFA9896_Printf("totest\n");
    /* Set MTPOTC=1*/
    mtp |= 0x01;
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0x005A);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    /* Update contents of MTP register*/
    err = TFA9896_WriteRegister(handle, 0x80, mtp);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_SetBits(handle, TFA1_BF_CIMTP, 0x01);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    tries = 0;
    do
    {
        tries++;
        for (i = 0; i < 0xfff; i++)
            ;
        mtpBusy = TFA9896_GetBits(handle, TFA1_BF_MTPB);
    } while ((mtpBusy == 0x01) && (tries < TFA9896_API_WAITRESULT_NTRIES));

    if (tries == TFA9896_API_WAITRESULT_NTRIES)
    {
        TFA9896_Printf("MTP Busy timedout\n");
        err = kStatus_TFA9896_StateTimedOut;
    }

    return err;
}

status_t TFA9896_SetFactoryValues(tfa9896_handle_t *handle)
{
    unsigned short mtp = 0, ron, regRead, xor;
    status_t err       = kStatus_TFA9896_Ok;
    int tries = 0, mtpBusy = 0;
    int i;

    TFA9896_Printf("totest\n");
    /*********Hardcoding MTPEX and MTPOTC***************************/
    mtp |= 0x03;
    /*********Hardcoding Ron  in MTP to 8 ohm***************************/
    ron = 0x1F40;
    err = TFA9896_ReadRegister(handle, 0x8B, &regRead);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    xor = regRead ^ 0x005A;
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0x005A);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x60, (uint16_t) xor);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_ReadRegister(handle, 0x32, &regRead);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    /*Update contents of MTP register*/
    err = TFA9896_WriteRegister(handle, 0x83, ron);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x80, mtp);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_SetBits(handle, TFA1_BF_CIMTP, 0x01);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    tries = 0;
    do
    {
        tries++;
        for (i = 0; i < 0xfff; i++)
            ;
        mtpBusy = TFA9896_GetBits(handle, TFA1_BF_MTPB);
    } while ((mtpBusy == 0x01) && (tries < TFA9896_API_WAITRESULT_NTRIES));

    if (tries == TFA9896_API_WAITRESULT_NTRIES)
    {
        TFA9896_Printf("MTP Busy timedout\n");
        err = kStatus_TFA9896_StateTimedOut;
    }

    return err;
}

status_t TFA9896_ClearOneTimeCalibration(tfa9896_handle_t *handle)
{
    status_t err = kStatus_TFA9896_Ok;
    unsigned short mtp;
    int tries = 0, mtpBusy = 0;
    int i;

    /* Read MTP register */
    err = TFA9896_ReadRegister(handle, 0x80, &mtp);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    /* Set MTPEX=0 and MTPOTC=0 to clear current calibration status*/
    mtp &= ~(0x03);
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x0B, (uint16_t)0x005A);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_WriteRegister(handle, 0x40, (uint16_t)0);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    /* Update contents of MTP register*/
    err = TFA9896_WriteRegister(handle, 0x80, mtp);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    err = TFA9896_SetBits(handle, TFA1_BF_CIMTP, 0x01);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    tries = 0;
    do
    {
        tries++;
        for (i = 0; i < 0xfff; i++)
            ;
        mtpBusy = TFA9896_GetBits(handle, TFA1_BF_MTPB);
    } while ((mtpBusy == 0x01) && (tries < TFA9896_API_WAITRESULT_NTRIES));

    if (tries == TFA9896_API_WAITRESULT_NTRIES)
    {
        TFA9896_Printf("MTP Busy timedout\n");
        err = kStatus_TFA9896_StateTimedOut;
    }

