solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/tfa9896/fsl_hal_registers.c
    return err;
}

status_t TFA9896_SetOVPBypass(tfa9896_handle_t *handle)
{
    status_t err;

    unsigned short value, xor;

    /* read the SystemControl register, modify the bit and write again */
    err = TFA9896_WriteRegister(handle, 0x40, 0x5A6B);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    err = TFA9896_ReadRegister(handle, 0x8B, &value);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    xor = value ^ 0x005A;
    err = TFA9896_WriteRegister(handle, 0x60, xor);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    err = TFA9896_ReadRegister(handle, 0x45, &value);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }
    TFA9896_Printf("before 0x45 regsiter is:%d\n", value);
    value |= (0x01 << 9);

    err = TFA9896_WriteRegister(handle, 0x45, value);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    err = TFA9896_ReadRegister(handle, 0x45, &value);
    if (err != kStatus_TFA9896_Ok)
    {
        return err;
    }

    TFA9896_Printf("after 0x45 regsiter is:%d\n", value);

    return err;
}

status_t TFA9896_SetMute(tfa9896_handle_t *handle, tfa9896_mute_t mute)
{
    status_t error;
    unsigned short audioctrl_value;
    unsigned short sysctrl_value;
    error = TFA9896_ReadRegister(handle, TFA9896_AUDIO_CTR, &audioctrl_value);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    error = TFA9896_ReadRegister(handle, TFA9896_SYS_CTRL, &sysctrl_value);

    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    switch (mute)
    {
        case Mute_Off:
            /* previous state can be digital or amplifier mute,
             * clear the cf_mute and set the enbl_amplifier bits
             *
             * To reduce PLOP at power on it is needed to switch the
             * amplifier on with the DCDC in follower mode (enbl_boost = 0 ?).
             * This workaround is also needed when toggling the powerdown bit!
             */
            audioctrl_value &= ~(TFA9896_AUDIO_CTR_CFSM_MSK);
            sysctrl_value |= TFA9896_SYS_CTRL_AMPE_MSK;
            sysctrl_value |= TFA9896_SYS_CTRL_DCA_MSK;
            break;
        case Mute_Digital:
            /* expect the amplifier to run */
            /* set the cf_mute bit */
            audioctrl_value |= TFA9896_AUDIO_CTR_CFSM_MSK;
            /* set the enbl_amplifier bit */
            sysctrl_value |= (TFA9896_SYS_CTRL_AMPE_MSK);
            /* clear active mode */
            sysctrl_value &= ~(TFA9896_SYS_CTRL_DCA_MSK);
            break;
        case Mute_Amplifier:
            /* clear the cf_mute bit */
            audioctrl_value &= ~TFA9896_AUDIO_CTR_CFSM_MSK;
            /* clear the enbl_amplifier bit and active mode */
            sysctrl_value &= ~(TFA9896_SYS_CTRL_AMPE_MSK | TFA9896_SYS_CTRL_DCA_MSK);
            break;
        default:
            error = kStatus_TFA9896_Bad_Parameter;
    }
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    error = TFA9896_WriteRegister(handle, TFA9896_AUDIO_CTR, audioctrl_value);
    if (error != kStatus_TFA9896_Ok)
    {
        return error;
    }
    error = TFA9896_WriteRegister(handle, TFA9896_SYS_CTRL, sysctrl_value);

    return error;
}
